#define __saveTask_C__
/******************************************************************************
* @file    saveTask.c
* @author  yx
* @version V1.0
* @date    2013-07-23
* @brief   配合 "FlsSave_Driver" 的接口。
* 
******************************************************************************/
#include  "saveTask.h"

#include  "Save_Manage_incOut.h"
#include  "saveTmrPwroffAndHist.h"
#include  "strFlsAdrDef.h"

//#include "incFile.h"	


/*================= 常数 ============================================*/

/*================= 结构定义 ========================================*/

/*================= 私有结构变量声明 ================================*/

/*================= 公有函数声明 ====================================*/

/*================= 私有函数声明 ====================================*/

/*=================  ================================================*/
		
/******************************************************************************
* FUNC: // 存储管理:
*   IN:
*  OUT: 
*  在flash 初始化后；时钟初始化后；
******************************************************************************/

BOOL Init_SaveTask(void)
{
	if(!bSave_CheckReDef())
	{
		return FALSE;
	}
	else if(!bCheckSaveItemConstDef())
	{
		return FALSE;
	}
	
    //FlsIdAssign_Init();//Init_SaveManage() have used
	SaveFlsId_Tmr_Init();
	Init_SaveManage();
	
	//存关机时间
	PwrOff_toHist(); 
	
	return TRUE;
}

/******************************************************************************
* FUNC: //
******************************************************************************/
void SaveTask_Exec(void)
{
	SaveManage_Exec();
	
	if(bSaveFlsId_Arrived())
	{
		FlsIdAssign_TmrAdd();
	}
}

/******************************************************************************
* FUNC: // END
*   IN:
*  OUT: 
******************************************************************************/
