#ifndef __phIoPwrState_H__
#define __phIoPwrState_H__
/******************************************************************************
* @file    phIoPwrState.h
* @author  yx
* @version V1.0
* @date    2013-08-22
* @brief   主备电工作状态
* 
#include  "phIoPwrState.h"
******************************************************************************/
//
#include  "prjCompileCon.h"

/*================= extern ============================================*/
#ifdef  __phIoPwrState_C__
#define EX_phIoPwrState
#else
#define EX_phIoPwrState extern 
#endif
/*================= 常数 ============================================*/
//#define 
/*================= 结构体定义 ======================================*/

/*================= 公有结构变量声明 ================================*/

/*================= 私有函数声明 ====================================*/
#ifdef  __phIoPwrState_C__

#endif  //__phIoPwrState_C__
/*================= 公有函数声明 ====================================*/
//EX_phIoPwrState 

extern void InitPwrStateTask(void);

extern void ExecPwrStateTask(void);

/******************************************************************************
// END :
******************************************************************************/
#endif // __phIoPwrState_H__

