#ifndef __phIoScan_H__
#define __phIoScan_H__
/******************************************************************************
* @file    phIoScan.h
* @author  yx
* @version V1.0
* @date    2012-01-05
* @brief   LED,KEY,Sound, 电源状态检测；电源检修开关状态监测。
* 
#include  "phIoScan.h"
******************************************************************************/

#include  "prjCompileCon.h"
/*================= extern ============================================*/
#ifdef  __phIoScan_C__
#define EX_phIoScan
#else
#define EX_phIoScan extern 
#endif

/*================= 常数 ============================================*/
//#define 
/*================= 结构体定义 ======================================*/

/*================= 公有结构变量声明 ================================*/

/*================= 公有函数声明 ====================================*/
//EX_phIoScan

extern void InitIoScan(void);

//定时执行. 处理函数。
extern void Exec_IoLedKeyScan(void);

//定时执行. ledKey建议在中断里精准定时。
//在中断里执行，所以不定时
extern void ExeInInt_IoLedKeyScan(void);

/******************************************************************************
// END :
******************************************************************************/
#endif // __phIoScan_H__

