#define __CanIntCouple_C__
/******************************************************************************
* @file    CanIntCouple.c
* @author  yx
* @version V1.0
* @date    2013-07-25
* @brief   控制会进行CAN收发操作的中断，防止代码复用。
* 
******************************************************************************/
#include  "CanIntCouple.h"


#include  "CanBufLib_ReDef.h"
#include  "hw00_HdInt.h"

/*================= 常数 ============================================*/

/*================= 结构定义 ========================================*/

/*================= 私有结构变量声明 ================================*/

/*================= 公有函数声明 ====================================*/

/*================= 私有函数声明 ====================================*/

/*=================  ================================================*/
		

/******************************************************************************
* FUNC: // 
*   IN:
*  OUT: bits: 1<<emHardWarePeriph
******************************************************************************/
//OUT: 中断的id由 enable变为disable的 bit。
U32 IntDisable_May_CanAdd(void)
{
	// return MyInt_N_Disable_RtnBits(
			  // (1<<U_Hd_Int_iCAN)
			// | (1<<U_Hd_Int_eCAN)
			// );
	return 0;
}


//IN:  中断的id由 enable变为disable的 bit，现在恢复enable的状态。
void IntEnable_May_CanAdd(U32 whichDisable)
{
	// MyInt_N_Enable_FromBits(whichDisable);
}

/******************************************************************************
* FUNC: // 
******************************************************************************/
U32 IntDisable_May_iCanAdd(void)
{
	// return IntDisable_May_CanAdd();
	return 0;
}

void IntEnable_May_iCanAdd(U32 whichDisable)
{
	// MyInt_N_Enable_FromBits(whichDisable);
}
/******************************************************************************
* FUNC: // 
******************************************************************************/
U32 IntDisable_May_eCanAdd(void)
{
	// return IntDisable_May_CanAdd();
	return 0;
}

void IntEnable_May_eCanAdd(U32 whichDisable)
{
	// MyInt_N_Enable_FromBits(whichDisable);
}

/******************************************************************************
* FUNC: // END
*   IN:
*  OUT: 
******************************************************************************/
