#ifndef __can11sPrtl_eCan_H__
#define __can11sPrtl_eCan_H__
/******************************************************************************
* @file    can11sPrtl_eCan.h
* @author  yx
* @version V1.0
* @date    2013-07-01
* @brief   
* 
#include  "can11sPrtl_eCan.h"
******************************************************************************/
//
#include  "prjCompileCon.h"
// Can帧格式：	
#include  "canProtocalStr.h"
#include  "canFrame.h"
// 

/*================= extern ============================================*/
#ifdef  __can11sPrtl_eCan_C__
#define EX_can11sPrtl_eCan
#else
#define EX_can11sPrtl_eCan extern 
#endif
/*================= 常数 ============================================*/
//#define 
/*================= 结构体定义 ======================================*/

/*================= 公有结构变量声明 ================================*/

/*================= 私有函数声明 ====================================*/
#ifdef  __can11sPrtl_eCan_C__

#endif  //__can11sPrtl_eCan_C__
/*================= 公有函数声明 ====================================*/
//EX_can11sPrtl_eCan 

extern U8 GetECan_MeAdr(void);

/******************************************************************************
// END :
******************************************************************************/
#endif // __can11sPrtl_eCan_H__

