#ifndef __can11sPrtlComm_H__
#define __can11sPrtlComm_H__
/******************************************************************************
* @file    can11sPrtlComm.h
* @author  yx
* @version V1.0
* @date    2013-07-01
* @brief   
* 
#include  "can11sPrtlComm.h"
******************************************************************************/
//
#include  "prjCompileCon.h"
// Can帧格式：	
#include  "canProtocalStr.h"
#include  "canFrame.h"
// 

/*================= extern ============================================*/
#ifdef  __can11sPrtlComm_C__
#define EX_can11sPrtlComm
#else
#define EX_can11sPrtlComm extern 
#endif
/*================= 常数 ============================================*/
//#define 
/*================= 结构体定义 ======================================*/

/*================= 公有结构变量声明 ================================*/

/*================= 私有函数声明 ====================================*/
#ifdef  __can11sPrtlComm_C__

#endif  //__can11sPrtlComm_C__
/*================= 公有函数声明 ====================================*/
//EX_can11sPrtlComm 


/******************************************************************************
// END :
******************************************************************************/
#endif // __can11sPrtlComm_H__

