#ifndef __lcdCst_WhenModify_H__
#define __lcdCst_WhenModify_H__
/******************************************************************************
* @file    lcdCst_WhenModify.h
* @author  yx
* @version V1.0
* @date    2013-07-01
* @brief   说明 修改menu或page时涉及的 file.
* 
#include  "lcdCst_WhenModify.h"
******************************************************************************/

/*================= lcdCst 修改说明 ============================================*/

/******************************************************************************
*  
*  改一个页面:   //查找 P013_SetClock ，改 PXXX .
		< lcdCst_PageNum.h >, 		//页面编号
		< lcdCst_PageFunction.h >,	//页面函数声明
		< lcdPg_Page.c >, 		//页面函数
		< lcdCst_Page.c >,  		//页面const
		< lcdCst_Menu.c >.		//菜单进入页面

*  添加一屏新的菜单：
		< lcdCst_Menu.c >.		//菜单进入页面
		注意前后菜单的衔接关系；
		emMenuId 分配一个唯一的号；
		pGetMenuBufFirAndTotal() 函数


******************************************************************************/

/******************************************************************************
如果是 parent-child 页面，
	chile页面 _First() 时，SetWinBoolState(U_WIN_PageSubIng_Sta);
	child页面 _Back() 时，要改变pageNum = parent;   因为在其他页面不太容易判断其parent是哪个。
	其余页面则不改变pageNum。
从操作进入菜单：SetWinBoolState(U_WIN_EntryMenu_Sta); 状态直至退出事件页面结束。
	若从事件进入菜单 不需要。

******************************************************************************/


/******************************************************************************
// END :
******************************************************************************/
#endif // __lcdCst_WhenModify_H__

