#ifndef __canPrtlComm_H__
#define __canPrtlComm_H__
/******************************************************************************
* @file    canPrtlComm.h
* @author  yx
* @version V1.0
* @date    2013-07-01
* @brief   
* 
#include  "canPrtlComm.h"
******************************************************************************/
//
#include  "prjCompileCon.h"
// Can帧格式：	
#include  "canProtocalStr.h"
#include  "canFrame.h"
// 

/*================= extern ============================================*/
#ifdef  __canPrtlComm_C__
#define EX_canPrtlComm
#else
#define EX_canPrtlComm extern 
#endif
/*================= 常数 ============================================*/
//#define 
/*================= 结构体定义 ======================================*/

/*================= 公有结构变量声明 ================================*/
/*
typedef struct{
	U8 sequStart;
}TStruct_st;
TStruct_st stStruct;
*/

/*-----------------    ----------------------------------*/

/*================= 私有函数声明 ====================================*/
#ifdef  __canPrtlComm_C__

#endif  //__canPrtlComm_C__
/*================= 公有函数声明 ====================================*/
//EX_canPrtlComm 


/******************************************************************************
// END :
******************************************************************************/
#endif // __canPrtlComm_H__

