#ifndef __canPrtl_iRx_H__
#define __canPrtl_iRx_H__
/******************************************************************************
* @file    canPrtl_iRx.h
* @author  yx
* @version V1.0
* @date    2013-07-01
* @brief   
* 
#include  "canPrtl_iRx.h"
******************************************************************************/
//
#include  "prjCompileCon.h"
// Can帧格式：	
#include  "canProtocalStr.h"
#include  "canFrame.h"
// 

/*================= extern ============================================*/
#ifdef  __canPrtl_iRx_C__
#define EX_canPrtl_iRx
#else
#define EX_canPrtl_iRx extern 
#endif
/*================= 常数 ============================================*/
//#define 
/*================= 结构体定义 ======================================*/

/*================= 公有结构变量声明 ================================*/
/*
typedef struct{
	U8 sequStart;
}TStruct_st;
TStruct_st stStruct;
*/

/*-----------------    ----------------------------------*/

/*================= 私有函数声明 ====================================*/
#ifdef  __canPrtl_iRx_C__

#endif  //__canPrtl_iRx_C__
/*================= 公有函数声明 ====================================*/
//EX_canPrtl_iRx 


/******************************************************************************
// END :
******************************************************************************/
#endif // __canPrtl_iRx_H__

