#ifndef __canPrtl_eTx_H__
#define __canPrtl_eTx_H__
/******************************************************************************
* @file    canPrtl_eTx.h
* @author  yx
* @version V1.0
* @date    2013-07-01
* @brief   
* 
#include  "canPrtl_eTx.h"
******************************************************************************/
//
#include  "prjCompileCon.h"
// Can帧格式：	
#include  "canProtocalStr.h"
#include  "canFrame.h"
// 

/*================= extern ============================================*/
#ifdef  __canPrtl_eTx_C__
#define EX_canPrtl_eTx
#else
#define EX_canPrtl_eTx extern 
#endif
/*================= 常数 ============================================*/
//#define 
/*================= 结构体定义 ======================================*/

/*================= 公有结构变量声明 ================================*/

/*================= 私有函数声明 ====================================*/
#ifdef  __canPrtl_eTx_C__
static void eCan_txNewFrm(void);

#endif  //__canPrtl_eTx_C__
/*================= 公有函数声明 ====================================*/
//EX_canPrtl_eTx 

extern void ECan_Tx_HeartBeat(void);

/******************************************************************************
// END :
******************************************************************************/
#endif // __canPrtl_eTx_H__

