#ifndef __saveUserLogin_H__
#define __saveUserLogin_H__
/******************************************************************************
* @file    saveUserLogin.h
* @author  yx
* @version V1.0
* @date    2013-01-04
* @brief   用户登录
* 
#include  "saveUserLogin.h"
******************************************************************************/
//
#include  "prjCompileCon.h"

/*================= extern ============================================*/
#ifdef  __saveUserLogin_C__
#define EX_saveUserLogin
#else
#define EX_saveUserLogin extern 
#endif
/*================= 常数 ============================================*/
//#define 
/*================= 结构体定义 ======================================*/

/*================= 公有结构变量声明 ================================*/
/*
typedef struct{
	U8 sequStart;
}TStruct_st;
TStruct_st stStruct;
*/


/*================= 私有函数声明 ====================================*/
#ifdef  __saveUserLogin_C__

#endif  //__saveUserLogin_C__
/*================= 公有函数声明-lib外部 ====================================*/
//EX_saveUserLogin 


/******************************************************************************
// END :
******************************************************************************/
#endif // __saveUserLogin_H__

