#ifndef __saveMachProbat_H__
#define __saveMachProbat_H__
/******************************************************************************
* @file    saveMachProbat.h
* @author  yx
* @version V1.0
* @date    2013-10-24
* @brief   试用期
* 
#include  "saveMachProbat.h"
******************************************************************************/
//
#include  "prjCompileCon.h"

/*================= extern ============================================*/
#ifdef  __saveMachProbat_C__
#define EX_saveMachProbat
#else
#define EX_saveMachProbat extern 
#endif
/*================= 常数 ============================================*/
//#define 
/*================= 结构体定义 ======================================*/

/*================= 公有结构变量声明 ================================*/

/*================= 私有函数声明 ====================================*/
#ifdef  __saveMachProbat_C__

#endif  //__saveMachProbat_C__

/*================= 公有函数声明-lib外部 ====================================*/
//EX_saveMachProbat 


/******************************************************************************
// END :
******************************************************************************/
#endif // __saveMachProbat_H__

